tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mas-cli/tap"
tap "exolnet/homebrew-deprecated"
tap "drud/ddev"
tap "wpscanteam/tap"

# Core packages
brew "zsh"
brew "coreutils"
brew "findutils"
brew "grep"
brew "rsync"
brew "git"
brew "vim"
brew "wget"
brew "pwgen"
brew "mas"
brew "wp-cli"
brew "mackup"
brew "thefuck"

# Development environment
brew "ddev"
cask "docker"

brew "composer"
cask "fork"
cask "iterm2"
cask "sequel-ace"
brew "wpscan"
brew "mc"

# Image related
brew "jpeg"
brew "imagemagick"
brew "jpegoptim"
brew "pngcrush"
brew "pngquant"
brew "optipng"
brew "svgo"

# Node related
# brew "yarn", args: ["without-node"]
brew "nvm"
brew "nave"

# Other Applications
cask "adobe-creative-cloud"
cask "firefox"
cask "google-chrome"
cask "plexamp"
cask "teamviewer"
cask "typora"
cask "visual-studio-code"
cask "yemuzip"
brew "weechat"

# App Store Applications
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Amphetamine", id: 937984704
mas "Barcode Basics", id: 756888963
mas "Textual IRC Client", id: 1262957439
mas "OTP Auth", id: 1471867429
