tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mas-cli/tap"
tap "exolnet/homebrew-deprecated"

# Core packages
brew "pkg-config"
brew "bash"
brew "coreutils"
brew "findutils"
brew "grep"
brew "rsync"
brew "git"
brew "vim"
brew "wget"
brew "pwgen"
brew "zsh"
brew "mas"
brew "wp-cli"

# Development environment
brew "httpd", restart_service: true
brew "mysql@5.7", restart_service: true, link: true
brew "php@5.6"
brew "php@7.0"
brew "php@7.1", link: false
brew "php@7.2", restart_service: true, link: true
brew "php@7.3", link: false
brew "dnsmasq", restart_service: true
brew "composer"

# Image related
brew "jpeg"
brew "imagemagick"
brew "jpegoptim"
brew "pngcrush"
brew "pngquant"
brew "optipng"

# Node related
brew "nave"
brew "yarn", args: ["without-node"]

cask "docker"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "local"
cask "plexamp"
cask "sequel-pro"
cask "teamviewer"
cask "visual-studio-code"
cask "yemuzip"

mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Amphetamine", id: 937984704
mas "Barcode Basics", id: 756888963
mas "Textual IRC Client", id: 1262957439
